{
    "stereotheque" : {
        "title":"Stereotheque",
        "id": "strtqe",
        "subtitle": "Professional Network App for Creative Industries",
        "description": "Developed a product management web application integrated with firebase to provide insightful observations using graphs and tables with up to date metrics related to product usage, employee task board, and more.",
        "techStack": [
            "React", "Firebase"
        ],
        "softwareTools": ["Heroku"],
        "webLink": "http://stereotheque.com/",
        "githubInfo": "",
        "hasGithub": false,
        "imgIndex":["0", "1", "2"],
        "hasVideo": false
    },
    "bmusic": {
        "title":"bMusic",
        "id": "bmusic",
        "subtitle": "Music Royalties Trading Platform",
        "description": "Created a semi decentralized web application that can be used as a marketplace to trade royalties, buy songs directly from artists and upload one's own songs to trade them using Ethereum's Blockchain. Combining the cloud's, blockchain's and the React's power, this marketplace allows users to get paid directly and securely without intermediaries. This was a University project.",
        "techStack": [
            "React", "Solidity", "Firebase"
        ],
        "softwareTools": [
            "Travis-CI", "Ethereum"
        ],
        "webLink": "",
        "githubInfo": "https://github.com/nyu-software-engineering/music-through-blockchain",
        "hasGithub": true,
        "imgIndex":["0","1","2","3","4"],
        "hasVideo": false
    },
    "constructionSite": {
        "title":"VR Construction Site",
        "id": "constructionSite",
        "subtitle": "Construction Site Demo in Oculus Quest 2 (VR)",
        "description": "This was project was made to demonstrate how can an architect firm could leverage the power of VR to pitch new ideas. It is a demo of an imaginary construction site.\n\nSome features I used in this project include dynamic and static lighting, locomotion using teleportation, animations, interactive UI (the minimap), interactive objects, ambient and spatial sound, Post-Processing Effects, and light baking for optimization. This project is supported in Oculus Quest 2.",
        "techStack": [
            "C#"
        ],
        "softwareTools": ["Unity, Oculus Quest 2"],
        "webLink": "",
        "githubInfo": "Project source code available upon request",
        "hasGithub": false,
        "imgIndex":["0"],
        "hasVideo": true
    },
    "jaxTheBarbarianAR": {
        "title":"Jax The Barbarian - AR Viking",
        "id": "jaxTheBarbarianAR",
        "subtitle": "Game demo to display the life and world of a viking for Android devices (AR).",
        "description": "This was project was made to recreate as close as possible the look and feel of the context story of a character and his world using Augmented Reality. \n\n Some features used to create this project include static and dynamic/response lighting, environment reflection, planar detection, image recognition, object spawning, 3D Asset preview and manipulation, sequenced animations, interactive and responsive UI, and post-processing effects with color grading. This project is supported to Android 11+ devices.",
        "techStack": [
            "C#"
        ],
        "softwareTools": ["Unity, Android"],
        "webLink": "",
        "githubInfo": "Project source code available upon request",
        "hasGithub": false,
        "imgIndex":["0"],
        "hasVideo": true
    },
    "budgetTracker": {
        "title":"Budget Tracker",
        "id": "budgetTracker",
        "subtitle": "Web app to keep track of my personal budget",
        "description": "This is a personal project of mine to keep track of my own budget. My idea is to purposely, manually add all the transaction that I make through the app so that I exactly know what I am spending and avoid staying out of my budget. \n\n I am constructing this app in phases. The first one is to be able to add, edit and delete transactions. I will create an API for this. The second one is to generate live reports on any time frame through graphs and spending categories. \n\n The third one will be to add some functionality to keep track of investments, loans and run scenarios on payments for each to plan out my financial strategies. THIS WEBSITE IS CURRENTLY UNDER CONSTRUCTION",
        "techStack": [
            "React"
        ],
        "softwareTools": [""],
        "webLink": "",
        "githubInfo": "Project source code available upon request",
        "hasGithub": false,
        "imgIndex":["0", "1"],
        "hasVideo": false
    }
}