{
    "stereotheque" : {
        "title":"Stereotheque",
        "id": "strtqe",
        "subtitle": "Professional Network App for Creative Industries",
        "description": "Developed a product management web application integrated with firebase to provide insightful observations using graphs and tables with up to date metrics related to product usage, employee task board, and more.",
        "techStack": [
            "React", "Firebase"
        ],
        "softwareTools": ["Heroku"],
        "webLink": "http://stereotheque.com/",
        "githubLink": "",
        "imgIndex":["0", "1", "2"],
        "hasVideo": false
    },
    "bmusic": {
        "title":"bMusic",
        "id": "bmusic",
        "subtitle": "Music Royalties Trading Platform",
        "description": "Created a semi decentralized web application that can be used as a marketplace to trade royalties, buy songs directly from artists and upload one's own songs to trade them using Ethereum's Blockchain. Combining the cloud's, blockchain's and the React's power, this marketplace allows users to get paid directly and securely without intermediaries. This was a University project.",
        "techStack": [
            "React", "Solidity", "Firebase"
        ],
        "softwareTools": [
            "Travis-CI", "Ethereum"
        ],
        "webLink": "",
        "githubLink": "https://github.com/nyu-software-engineering/music-through-blockchain",
        "imgIndex":["0","1","2","3","4"],
        "hasVideo": false
    },
    "kevn": {
        "title":"Kevn",
        "id": "kevn",
        "subtitle": "Official Website for Kevn",
        "description": "Created the official website for Kevn, and up and coming producer and song writer from Berklee College of Music. Through it, users will be able to track Kevn's work by checking his most recent tracks, samples and demos, among other works. Kevn will be able to retain subscribers' emails to send out newsletters, and get in touch with potential clients. THIS WEBSITE IS CURRENTLY UNDER DEVELOPMENT",
        "techStack": [
            "React"
        ],
        "softwareTools": [""],
        "webLink": "",
        "githubLink": "https://github.com/Nlopierre/kevn",
        "imgIndex":["0"],
        "hasVideo": false
    },
    "constructionSite": {
        "title":"VR Construction Site",
        "id": "constructionSite",
        "subtitle": "Construction Site Demo in Oculus Quest 2 (VR)",
        "description": "This was project was made to demostrate how can an architect firm could leverage the power of VR to pitch new ideas. It is a demo of an imaginary construction site.\n\nSome features I used in this project include dynamic and static lighting,   locomotion using teleportation, animations, interactive UI (the minimap), interactive objects, ambient and spatial sound, Post-Processing Effects, and light baking for optimization. This project was deployed to Oculus Quest 2.",
        "techStack": [
            "Oculus Quest 2"
        ],
        "softwareTools": ["Unity"],
        "webLink": "",
        "githubLink": "",
        "imgIndex":["0"],
        "hasVideo": true
    }
}